{"recipes":[{"title":"Chorizo and Chicken Skewers","link":"https://www.allrecipes.com/recipe/238132/chorizo-and-chicken-skewers/?internalSource=rotd&referringId=16705&referringContentType=Recipe%20Hub","ingredients":["2 skinless, boneless chicken breasts, cut into 20 pieces","8 ounces Spanish chorizo, cut into 1/2 inch pieces","1 tablespoon olive oil","1 tablespoon sherry vinegar","2 teaspoons chopped fresh oregano","1 pinch cayenne pepper, or to taste","salt and ground black pepper to taste","1 red onion, cut into 1-inch squares","1 red bell pepper, cut into 1-inch squares","4 (12-inch) bamboo or metal skewers"],"steps":["Preheat an outdoor grill for medium-high heat and lightly oil the grate.","Place chicken and chorizo in a large bowl; add olive oil, sherry vinegar, oregano, cayenne pepper, black pepper, and salt. Stir until chicken and chorizo are completely coated.","Thread chicken, chorizo, red onion, and red bell pepper evenly onto 4 skewers, making sure that each piece of chicken touches 1 piece of chorizo. Place finished skewers on a plate, cover with plastic wrap, and refrigerate until cold 15 to 30 minutes.","Cook on the preheated grill, turning occasionally, until chicken is cooked through, about 10 minutes."],"class":["paleo"]},{"title":"Pepperoni Meatza","link":"https://www.allrecipes.com/recipe/228652/pepperoni-meatza/?internalSource=staff%20pick&referringId=16705&referringContentType=Recipe%20Hub","ingredients":["1 tablespoon salt","1 teaspoon caraway seeds (optional)","1 teaspoon dried oregano","1 teaspoon garlic salt","1 teaspoon ground black pepper","1 teaspoon red pepper flakes, or to taste (optional)","2 pounds extra lean ground beef","2 eggs","1/2 cup grated Parmesan cheese","1 (12 ounce) package shredded mozzarella cheese","1 cup tomato sauce","1 (3.5 ounce) package sliced pepperoni, or to taste"],"steps":["Preheat oven to 450 degrees F (230 degrees C).","Mix together salt, caraway seeds, oregano, garlic salt, ground black pepper, and crushed red pepper flakes in a small bowl.","Mix ground beef and eggs in a mixing bowl until thoroughly incorporated. Add Parmesan cheese and seasoning mixture to beef; combine. Press ground beef mixture into a 12x17-inch pan, spread out evenly.","Bake in the preheated oven until meat is no longer pink, about 10 minutes. Drain grease.","Set oven rack about 6 inches from the heat source and turn on the oven's broiler.","Sprinkle 1/3 of the mozzarella cheese over baked meat, followed by tomato sauce in an even layer. Sprinkle another 1/3 of the mozzarella cheese over the sauce and top with slices of pepperoni. Sprinkle remaining mozzarella cheese over pizza.","Broil until cheese is melted, bubbling, and lightly browned, 3 to 5 minutes."],"class":["paleo"]},{"title":"Berry Coconut Smoothie","link":"https://www.allrecipes.com/recipe/246614/berry-coconut-smoothie/?internalSource=staff%20pick&referringId=16705&referringContentType=Recipe%20Hub","ingredients":[],"steps":[],"class":["paleo"]},{"title":"Paleo Chili","link":"https://www.allrecipes.com/recipe/235014/paleo-chili/?internalSource=staff%20pick&referringId=16705&referringContentType=Recipe%20Hub","ingredients":["1 dried chipotle pepper, stem removed","1 cup boiling water","1 1/2 teaspoons coconut oil","1 cup chopped yellow onion","1 cup chopped green bell pepper","1 cup chopped red bell pepper","4 garlic cloves, minced","1 pound ground bison","1/2 pound spicy ground pork sausage","1 tablespoon chili powder","1 tablespoon ground cumin","1 teaspoon dried oregano","1 teaspoon unsweetened cocoa powder","1 teaspoon Worcestershire sauce","1 (28 ounce) can crushed tomatoes","1 1/2 teaspoons kosher salt","1/2 teaspoon ground black pepper"],"steps":["Soak chipotle pepper in boiling water until softened, about 10 minutes. Remove pepper from water and mince.","Melt coconut oil in a large pot over medium heat. Cook and stir onion, green bell pepper, and red bell pepper until tender, 5 to 10 minutes. Stir garlic and minced chipotle into onion mixture and cook until fragrant, about 1 minute.","Stir bison and sausage into onion mixture. Cook and stir until meat is browned and crumbly, 10 to 12 minutes.","Stir chili powder, cumin, oregano, cocoa powder, and Worcestershire sauce into the bison mixture; add crushed tomatoes, salt, and pepper and stir. Bring to a boil, reduce heat to low, and simmer until flavors are blended, 10 minutes."],"class":["paleo"]},{"title":"Quick and Spicy Spaghetti Squash","link":"https://www.allrecipes.com/recipe/244808/quick-and-spicy-spaghetti-squash/?internalSource=staff%20pick&referringId=16705&referringContentType=Recipe%20Hub","ingredients":["1 spaghetti squash, halved and seeded","2 tablespoons olive oil, divided","2 tablespoons chopped fresh parsley","1 tablespoon red pepper flakes","salt and ground black pepper to taste"],"steps":["Preheat oven to 350 degrees F (175 degrees C).","Coat the inside of squash with about 1 tablespoon olive oil. Place squash, cut-side down, on a baking sheet.","Bake in the preheated oven until squash is tender, about 30 minutes. Cool squash for 10 minutes.","Shred the inside of squash with a fork and transfer to a bowl. Add remaining olive oil, parsley, red pepper flakes, salt, and pepper to shredded squash and toss to coat."],"class":["paleo"]},{"title":"Paleo Stuffed Cabbage","link":"https://www.allrecipes.com/recipe/256611/paleo-stuffed-cabbage/?internalSource=staff%20pick&referringId=16705&referringContentType=Recipe%20Hub","ingredients":["Tomato Sauce:","1 (28 ounce) can crushed San Marzano tomatoes","1 cup low-sodium chicken broth","1 clove garlic, minced","1 teaspoon dried parsley","1 (8 ounce) can tomato paste","1 teaspoon sea salt","1/2 teaspoon ground black pepper","1 pound ground beef","1 pound ground pork","1 small yellow onion, chopped","3 cloves garlic, minced","1 teaspoon dried basil","1 teaspoon dried oregano","1/2 teaspoon dried parsley","1/2 teaspoon sea salt","1/4 teaspoon ground black pepper","2 tablespoons sea salt","3/4 head cauliflower","2 heads green cabbage","1 zucchini","2 eggs","1/4 cup almond flour"],"steps":["Combine tomatoes, chicken broth, 1 clove garlic, and 1 teaspoon parsley in a saucepan; bring to a boil. Add tomato paste. Fill the can 1/4 of the way with hot water; swirl to dissolve any tomato paste remaining in the can and pour into the saucepan. Season sauce with 1 teaspoon salt and 1/2 teaspoon pepper. Simmer until flavors combine, about 30 minutes.","Preheat oven to 350 degrees F (175 degrees C).","Mix beef, pork, onion, 3 cloves garlic, basil, oregano, 1/2 teaspoon parsley, 1/2 teaspoon salt, and 1/4 teaspoon pepper together in a large bowl.","Bring a large pot of water to a boil; add 2 tablespoons sea salt. Add cauliflower; cook for 5 minutes. Transfer to a bowl using a slotted spoon. Add 1 head of cabbage to the boiling water; cook for 5 minutes. Remove with the slotted spoon. Repeat with second cabbage. Separate cabbage leaves.","Shred cauliflower and zucchini in a food processor fitted with the shredder disk. Add enough to the beef mixture so there is an equal ratio of both. Stir in eggs and almond flour.","Lay 1 cabbage leaf on a flat surface. Roll 1 tablespoon of the beef mixture into a log and place in the middle of the leaf. Overlap with the bottom of the leaf; fold in opposing edges and roll up. Repeat with remaining leaves and beef mixture.","Coat the bottom of a large baking dish with a layer of tomato sauce. Arrange cabbage rolls seam-side down in the dish; cover with remaining tomato sauce. Cover dish with aluminum foil.","Bake in the preheated oven until sauce is bubbling, about 1 hour."],"class":["paleo"]},{"title":"Mango-Bacon-Butternut Squash Hash","link":"https://www.allrecipes.com/recipe/228100/mango-bacon-butternut-squash-hash/?internalSource=staff%20pick&referringId=16705&referringContentType=Recipe%20Hub","ingredients":["3 slices bacon, cut into 1/4-inch squares","1 butternut squash, peeled and cubed","1 teaspoon thyme","1 mango, peeled and cubed","salt and ground black pepper, to taste"],"steps":["Place bacon in a large skillet and cook over medium-high heat, turning occasionally, until evenly browned, about 5 minutes. Add squash and thyme; cook and stir until squash begins to brown, 10 to 15 minutes. Add mango; cook and stir until heated through, about 5 minutes."],"class":["paleo"]},{"title":"Dark Chocolate Almond Rocks","link":"https://www.allrecipes.com/recipe/256321/dark-chocolate-almond-rocks/?internalSource=staff%20pick&referringId=16705&referringContentType=Recipe%20Hub","ingredients":["1/2 cup almonds, crushed into chunks","7 ounces dark chocolate chips (50% cacao)"],"steps":["Spread almonds in a large skillet; toast over medium heat until starting to brown, 3 to 5 minutes. Pour almonds into a bowl.","Melt chocolate in top of a double boiler over simmering water, stirring frequently and scraping down the sides to avoid scorching, about 5 minutes. Remove from heat; pour in almonds and stir until evenly coated.","Drop spoonfuls of chocolate-almond mixture onto a plate lined with waxed paper.","Chill until set, about 10 minutes."],"class":["paleo"]},{"title":"Roasted Cauliflower \"Rice\"","link":"https://www.allrecipes.com/recipe/254342/roasted-cauliflower-rice/?internalSource=staff%20pick&referringId=16705&referringContentType=Recipe%20Hub","ingredients":["cooking spray","2 heads cauliflower, cut into 1/2-inch pieces","1 1/2 tablespoons avocado oil","3/4 teaspoon salt, divided"],"steps":["Preheat oven to 450 degrees F (230 degrees C). Line 3 baking sheets with aluminum foil and lightly spray with cooking spray.","Fill a food processor 1/4 of the way with cauliflower pieces. Pulse 8 to 12 times until cauliflower is the size of rice grains. Transfer to a large bowl. Repeat with remaining cauliflower pieces.","Drizzle avocado oil over cauliflower \"rice\"; toss until well-distributed.","Spread 2 1/2 cups of the rice in an even layer on each lined baking sheet.","Roast rice until golden, about 16 minutes. Remove from oven, stir well, and spread out again. Return to oven and roast for 6 minutes. Remove from oven, stir well, and spread out again. Continue roasting until browned, about 5 minutes more.","Season each sheet of roasted rice with 1/4 teaspoon salt and place in a large container."],"class":["paleo"]},{"title":"Taco Seasoning I","link":"https://www.allrecipes.com/recipe/46653/taco-seasoning-i/?internalSource=hub%20recipe&referringId=16705&referringContentType=Recipe%20Hub","ingredients":["1 tablespoon chili powder","1/4 teaspoon garlic powder","1/4 teaspoon onion powder","1/4 teaspoon crushed red pepper flakes","1/4 teaspoon dried oregano","1/2 teaspoon paprika","1 1/2 teaspoons ground cumin","1 teaspoon sea salt","1 teaspoon black pepper"],"steps":["In a small bowl, mix together chili powder, garlic powder, onion powder, red pepper flakes, oregano, paprika, cumin, salt and pepper. Store in an airtight container."],"class":["paleo"]},{"title":"Guacamole","link":"https://www.allrecipes.com/recipe/14231/guacamole/?internalSource=hub%20recipe&referringId=16705&referringContentType=Recipe%20Hub","ingredients":["3 avocados - peeled, pitted, and mashed","1 lime, juiced","1 teaspoon salt","1/2 cup diced onion","3 tablespoons chopped fresh cilantro","2 roma (plum) tomatoes, diced","1 teaspoon minced garlic","1 pinch ground cayenne pepper (optional)"],"steps":["In a medium bowl, mash together the avocados, lime juice, and salt. Mix in onion, cilantro, tomatoes, and garlic. Stir in cayenne pepper. Refrigerate 1 hour for best flavor, or serve immediately."],"class":["paleo"]},{"title":"Braised Balsamic Chicken","link":"https://www.allrecipes.com/recipe/8665/braised-balsamic-chicken/?internalSource=hub%20recipe&referringId=16705&referringContentType=Recipe%20Hub","ingredients":["6 skinless, boneless chicken breast halves","1 teaspoon garlic salt","ground black pepper to taste","2 tablespoons olive oil","1 onion, thinly sliced","1 (14.5 ounce) can diced tomatoes","1/2 cup balsamic vinegar","1 teaspoon dried basil","1 teaspoon dried oregano","1 teaspoon dried rosemary","1/2 teaspoon dried thyme"],"steps":["Season both sides of chicken breasts with garlic salt and pepper.","Heat olive oil in a skillet over medium heat; cook seasoned chicken breasts until chicken is browned, 3 to 4 minutes per side. Add onion; cook and stir until onion is browned, 3 to 4 minutes.","Pour diced tomatoes and balsamic vinegar over chicken; season with basil, oregano, rosemary and thyme. Simmer until chicken is no longer pink and the juices run clear, about 15 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C)."],"class":["paleo"]},{"title":"Roast Sticky Chicken-Rotisserie Style","link":"https://www.allrecipes.com/recipe/45954/roast-sticky-chicken-rotisserie-style/?internalSource=hub%20recipe&referringId=16705&referringContentType=Recipe%20Hub","ingredients":["4 teaspoons salt","2 teaspoons paprika","1 teaspoon onion powder","1 teaspoon dried thyme","1 teaspoon white pepper","1/2 teaspoon cayenne pepper","1/2 teaspoon black pepper","1/2 teaspoon garlic powder","2 onions, quartered","2 (4 pound) whole chickens"],"steps":["In a small bowl, mix together salt, paprika, onion powder, thyme, white pepper, black pepper, cayenne pepper, and garlic powder. Remove and discard giblets from chicken. Rinse chicken cavity, and pat dry with paper towel. Rub each chicken inside and out with spice mixture. Place 1 onion into the cavity of each chicken. Place chickens in a resealable bag or double wrap with plastic wrap. Refrigerate overnight, or at least 4 to 6 hours.","Preheat oven to 250 degrees F (120 degrees C).","Place chickens in a roasting pan. Bake uncovered for 5 hours, to a minimum internal temperature of 180 degrees F (85 degrees C). Let the chickens stand for 10 minutes before carving."],"class":["paleo"]},{"title":"Roasted Brussels Sprouts","link":"https://www.allrecipes.com/recipe/67952/roasted-brussels-sprouts/?internalSource=hub%20recipe&referringId=16705&referringContentType=Recipe%20Hub","ingredients":["1 1/2 pounds Brussels sprouts, ends trimmed and yellow leaves removed","3 tablespoons olive oil","1 teaspoon kosher salt","1/2 teaspoon freshly ground black pepper"],"steps":["Preheat oven to 400 degrees F (205 degrees C).","Place trimmed Brussels sprouts, olive oil, kosher salt, and pepper in a large resealable plastic bag. Seal tightly, and shake to coat. Pour onto a baking sheet, and place on center oven rack.","Roast in the preheated oven for 30 to 45 minutes, shaking pan every 5 to 7 minutes for even browning. Reduce heat when necessary to prevent burning. Brussels sprouts should be darkest brown, almost black, when done. Adjust seasoning with kosher salt, if necessary. Serve immediately."],"class":["paleo"]},{"title":"Marinated Grilled Shrimp","link":"https://www.allrecipes.com/recipe/21694/marinated-grilled-shrimp/?internalSource=hub%20recipe&referringId=16705&referringContentType=Recipe%20Hub","ingredients":["3 cloves garlic, minced","1/3 cup olive oil","1/4 cup tomato sauce","2 tablespoons red wine vinegar","2 tablespoons chopped fresh basil","1/2 teaspoon salt","1/4 teaspoon cayenne pepper","2 pounds fresh shrimp, peeled and deveined","skewers"],"steps":["In a large bowl, stir together the garlic, olive oil, tomato sauce, and red wine vinegar. Season with basil, salt, and cayenne pepper. Add shrimp to the bowl, and stir until evenly coated. Cover, and refrigerate for 30 minutes to 1 hour, stirring once or twice.","Preheat grill for medium heat. Thread shrimp onto skewers, piercing once near the tail and once near the head. Discard marinade.","Lightly oil grill grate. Cook shrimp on preheated grill for 2 to 3 minutes per side, or until opaque."],"class":["paleo"]},{"title":"Juicy Roasted Chicken","link":"https://www.allrecipes.com/recipe/83557/juicy-roasted-chicken/?internalSource=hub%20recipe&referringId=16705&referringContentType=Recipe%20Hub","ingredients":["1 (3 pound) whole chicken, giblets removed","salt and black pepper to taste","1 tablespoon onion powder, or to taste","1/2 cup margarine, divided","1 stalk celery, leaves removed"],"steps":["Preheat oven to 350 degrees F (175 degrees C).","Place chicken in a roasting pan, and season generously inside and out with salt and pepper. Sprinkle inside and out with onion powder. Place 3 tablespoons margarine in the chicken cavity. Arrange dollops of the remaining margarine around the chicken's exterior. Cut the celery into 3 or 4 pieces, and place in the chicken cavity.","Bake uncovered 1 hour and 15 minutes in the preheated oven, to a minimum internal temperature of 180 degrees F (82 degrees C). Remove from heat, and baste with melted margarine and drippings. Cover with aluminum foil, and allow to rest about 30 minutes before serving."],"class":["paleo"]},{"title":"Baked Kale Chips","link":"https://www.allrecipes.com/recipe/176957/baked-kale-chips/?internalSource=hub%20recipe&referringId=16705&referringContentType=Recipe%20Hub","ingredients":["1 bunch kale","1 tablespoon olive oil","1 teaspoon seasoned salt"],"steps":["Preheat an oven to 350 degrees F (175 degrees C). Line a non insulated cookie sheet with parchment paper.","With a knife or kitchen shears carefully remove the leaves from the thick stems and tear into bite size pieces. Wash and thoroughly dry kale with a salad spinner. Drizzle kale with olive oil and sprinkle with seasoning salt.","Bake until the edges brown but are not burnt, 10 to 15 minutes."],"class":["paleo"]},{"title":"Balsamic Roasted Pork Loin","link":"https://www.allrecipes.com/recipe/132815/balsamic-roasted-pork-loin/?internalSource=hub%20recipe&referringId=16705&referringContentType=Recipe%20Hub","ingredients":["2 tablespoons steak seasoning rub","1/2 cup balsamic vinegar","1/2 cup olive oil","2 pounds boneless pork loin roast"],"steps":["Dissolve steak seasoning in balsamic vinegar, then stir in olive oil. Place pork into a resealable plastic bag and pour marinade overtop. Squeeze out air and seal bag; marinate 2 hours to overnight. Watch Now","Preheat oven to 350 degrees F (175 degrees C). Watch Now","Place pork into a glass baking dish along with marinade. Bake in preheated oven, basting occasionally until the pork reaches an internal temperature of 145 degrees F (65 degrees C), about 1 hour. Let the roast rest for 10 minutes before slicing and serving. Watch Now"],"class":["paleo"]},{"title":"Garlic Prime Rib","link":"https://www.allrecipes.com/recipe/56352/garlic-prime-rib/?internalSource=hub%20recipe&referringId=16705&referringContentType=Recipe%20Hub","ingredients":["1 (10 pound) prime rib roast","10 cloves garlic, minced","2 tablespoons olive oil","2 teaspoons salt","2 teaspoons ground black pepper","2 teaspoons dried thyme"],"steps":["Place the roast in a roasting pan with the fatty side up. In a small bowl, mix together the garlic, olive oil, salt, pepper and thyme. Spread the mixture over the fatty layer of the roast, and let the roast sit out until it is at room temperature, no longer than 1 hour.","Preheat the oven to 500 degrees F (260 degrees C).","Bake the roast for 20 minutes in the preheated oven, then reduce the temperature to 325 degrees F (165 degrees C), and continue roasting for an additional 60 to 75 minutes. The internal temperature of the roast should be at 135 degrees F (57 degrees C) for medium rare.","Allow the roast to rest for 10 or 15 minutes before carving so the meat can retain its juices."],"class":["paleo"]},{"title":"High Temperature Eye-of-Round Roast","link":"https://www.allrecipes.com/recipe/94113/high-temperature-eye-of-round-roast/?internalSource=hub%20recipe&referringId=16705&referringContentType=Recipe%20Hub","ingredients":["1 (3 pound) beef eye of round roast","salt and pepper to taste"],"steps":["Preheat the oven to 500 degrees F (260 degrees C). Season the roast with salt and pepper and place in a roasting pan or baking dish. Do not cover or add water.","Place the roast in the preheated oven. Reduce the temperature to 475 degrees F (245 degrees C). Roast for 21 minutes (seven minutes per pound) then turn off the oven and let the roast sit in the hot oven for 2 1/2 hours. Do not open the door at all during this time!","Remove the roast from the oven, the internal temperature should have reached at least 145 degrees F (65 degrees C). Carve into thin slices to serve."],"class":["paleo"]},{"title":"Best Marinara Sauce Yet","link":"https://www.allrecipes.com/recipe/11966/best-marinara-sauce-yet/?internalSource=hub%20recipe&referringId=16705&referringContentType=Recipe%20Hub","ingredients":["2 (14.5 ounce) cans stewed tomatoes","1 (6 ounce) can tomato paste","4 tablespoons chopped fresh parsley","1 clove garlic, minced","1 teaspoon dried oregano","1 teaspoon salt","1/4 teaspoon ground black pepper","6 tablespoons olive oil","1/3 cup finely diced onion","1/2 cup white wine"],"steps":["In a food processor place Italian tomatoes, tomato paste, chopped parsley, minced garlic, oregano, salt, and pepper. Blend until smooth.","In a large skillet over medium heat saute the finely chopped onion in olive oil for 2 minutes. Add the blended tomato sauce and white wine.","Simmer for 30 minutes, stirring occasionally."],"class":["paleo"]},{"title":"Baked Slow Cooker Chicken","link":"https://www.allrecipes.com/recipe/8647/baked-slow-cooker-chicken/?internalSource=hub%20recipe&referringId=16705&referringContentType=Recipe%20Hub","ingredients":["1 (2 to 3 pound) whole chicken","salt and pepper to taste","1 teaspoon paprika"],"steps":["Wad three pieces of aluminum foil into 3 to 4 inch balls, and place them in the bottom of the slow cooker.","Rinse the chicken, inside and out, under cold running water. Pat dry with paper towels. Season the chicken with the salt, pepper and paprika, and place in the slow cooker on top of the crumpled aluminum foil.","Set the slow cooker to High for 1 hour, then turn down to Low for about 8 to 10 hours, or until the chicken is no longer pink and the juices run clear."],"class":["paleo"]},{"title":"Foolproof Rib Roast","link":"https://www.allrecipes.com/recipe/97621/foolproof-rib-roast/?internalSource=hub%20recipe&referringId=16705&referringContentType=Recipe%20Hub","ingredients":["1 (5 pound) standing beef rib roast","2 teaspoons salt","1 teaspoon ground black pepper","1 teaspoon garlic powder"],"steps":["Allow roast to stand at room temperature for at least 1 hour.","Preheat the oven to 375 degrees F (190 degrees C). Combine the salt, pepper and garlic powder in a small cup. Place the roast on a rack in a roasting pan so that the fatty side is up and the rib side is on the bottom. Rub the seasoning onto the roast.","Roast for 1 hour in the preheated oven. Turn the oven off and leave the roast inside. Do not open the door. Leave it in there for 3 hours. 30 to 40 minutes before serving, turn the oven back on at 375 degrees F (190 degrees C) to reheat the roast. The internal temperature should be at least 145 degrees F (62 degrees C). Remove from the oven and let rest for 10 minutes before carving into servings."],"class":["paleo"]},{"title":"Herb Rubbed Sirloin Tip Roast","link":"https://www.allrecipes.com/recipe/54839/herb-rubbed-sirloin-tip-roast/?internalSource=hub%20recipe&referringId=16705&referringContentType=Recipe%20Hub","ingredients":["1 1/4 tablespoons paprika","1 tablespoon kosher salt","1 teaspoon garlic powder","1/2 teaspoon ground black pepper","1/2 teaspoon onion powder","1/2 teaspoon ground cayenne pepper","1/2 teaspoon dried oregano","1/2 teaspoon dried thyme","2 tablespoons olive oil","1 (3 pound) sirloin tip roast"],"steps":["In a small bowl, mix the paprika, kosher salt, garlic powder, black pepper, onion powder, cayenne pepper, oregano, and thyme. Stir in the olive oil, and allow the mixture to sit about 15 minutes.","Preheat oven to 350 degrees F (175 degrees C). Line a baking sheet with aluminum foil.","Place the roast on the prepared baking sheet, and cover on all sides with the spice mixture.","Roast 1 hour in the preheated oven, or to a minimum internal temperature of 145 degrees F (63 degrees C). Let sit 15 minutes before slicing."],"class":["paleo"]},{"title":"Filet Mignon with Rich Balsamic Glaze","link":"https://www.allrecipes.com/recipe/30578/filet-mignon-with-rich-balsamic-glaze/?internalSource=hub%20recipe&referringId=16705&referringContentType=Recipe%20Hub","ingredients":["2 (4 ounce) filet mignon steaks","1/2 teaspoon freshly ground black pepper to taste","salt to taste","1/4 cup balsamic vinegar","1/4 cup dry red wine"],"steps":["Sprinkle freshly ground pepper over both sides of each steak, and sprinkle with salt to taste.","Heat a nonstick skillet over medium-high heat. Place steaks in hot pan, and cook for 1 minute on each side, or until browned. Reduce heat to medium-low, and add balsamic vinegar and red wine. Cover, and cook for 4 minutes on each side, basting with sauce when you turn the meat over.","Remove steaks to two warmed plates, spoon one tablespoon of glaze over each, and serve immediately."],"class":["paleo"]},{"title":"Roasted Pork Loin","link":"https://www.allrecipes.com/recipe/21766/roasted-pork-loin/?internalSource=hub%20recipe&referringId=16705&referringContentType=Recipe%20Hub","ingredients":["3 cloves garlic, minced","1 tablespoon dried rosemary","salt and pepper to taste","2 pounds boneless pork loin roast","1/4 cup olive oil","1/2 cup white wine"],"steps":["Preheat oven to 350 degrees F (175 degrees C).","Crush garlic with rosemary, salt and pepper, making a paste. Pierce meat with a sharp knife in several places and press the garlic paste into the openings. Rub the meat with the remaining garlic mixture and olive oil.","Place pork loin into oven, turning and basting with pan liquids. Cook until the pork is no longer pink in the center, about 1 hour. An instant-read thermometer inserted into the center should read 145 degrees F (63 degrees C). Remove roast to a platter. Heat the wine in the pan and stir to loosen browned bits of food on the bottom. Serve with pan juices."],"class":["paleo"]},{"title":"Crispy and Tender Baked Chicken Thighs","link":"https://www.allrecipes.com/recipe/235151/crispy-and-tender-baked-chicken-thighs/?internalSource=hub%20recipe&referringId=16705&referringContentType=Recipe%20Hub","ingredients":["cooking spray","8 bone-in chicken thighs with skin","1/4 teaspoon garlic salt","1/4 teaspoon onion salt","1/4 teaspoon dried oregano","1/4 teaspoon ground thyme","1/4 teaspoon paprika","1/4 teaspoon ground black pepper"],"steps":["Preheat oven to 350 degrees F (175 degrees C). Line a baking sheet with aluminum foil and spray with cooking spray.","Arrange chicken thighs on prepared baking sheet.","Combine garlic salt, onion salt, oregano, thyme, paprika, and pepper together in a small container with a lid. Close the lid and shake container until spices are thoroughly mixed. Sprinkle spice mixture liberally over chicken thighs.","Bake chicken in the preheated oven until skin is crispy, thighs are no longer pink at the bone, and the juices run clear, about 1 hour. An instant-read thermometer inserted near the bone should read 165 degrees F (74 degrees C)."],"class":["paleo"]},{"title":"Unstuffed Cabbage Roll","link":"https://www.allrecipes.com/recipe/235997/unstuffed-cabbage-roll/?internalSource=hub%20recipe&referringId=16705&referringContentType=Recipe%20Hub","ingredients":["2 pounds ground beef","1 large onion, chopped","1 small head cabbage, chopped","2 (14.5 ounce) cans diced tomatoes","1 (8 ounce) can tomato sauce","1/2 cup water","2 cloves garlic, minced","2 teaspoons salt","1 teaspoon ground black pepper"],"steps":["Heat a Dutch oven or large skillet over medium-high heat. Cook and stir beef and onion in the hot Dutch oven until browned and crumbly, 5 to 7 minutes; drain and discard grease. Add cabbage, tomatoes, tomato sauce, water, garlic, salt, and pepper and bring to a boil. Cover Dutch oven, reduce heat, and simmer until cabbage is tender, about 30 minutes."],"class":["paleo"]},{"title":"Rosemary Roasted Turkey","link":"https://www.allrecipes.com/recipe/13525/rosemary-roasted-turkey/?internalSource=hub%20recipe&referringId=16705&referringContentType=Recipe%20Hub","ingredients":["3/4 cup olive oil","3 tablespoons minced garlic","2 tablespoons chopped fresh rosemary","1 tablespoon chopped fresh basil","1 tablespoon Italian seasoning","1 teaspoon ground black pepper","salt to taste","1 (12 pound) whole turkey"],"steps":["Preheat oven to 325 degrees F (165 degrees C).","In a small bowl, mix the olive oil, garlic, rosemary, basil, Italian seasoning, black pepper and salt. Set aside.","Wash the turkey inside and out; pat dry. Remove any large fat deposits. Loosen the skin from the breast. This is done by slowly working your fingers between the breast and the skin. Work it loose to the end of the drumstick, being careful not to tear the skin.","Using your hand, spread a generous amount of the rosemary mixture under the breast skin and down the thigh and leg. Rub the remainder of the rosemary mixture over the outside of the breast. Use toothpicks to seal skin over any exposed breast meat.","Place the turkey on a rack in a roasting pan. Add about 1/4 inch of water to the bottom of the pan. Roast in the preheated oven 3 to 4 hours, or until the internal temperature of the bird reaches 180 degrees F (80 degrees C)."],"class":["paleo"]}]}