{"recipes":[{"title":"Baked Salmon II","link":"https://www.allrecipes.com/recipe/34746/baked-salmon-ii/?internalSource=rotd&referringId=13290&referringContentType=Recipe%20Hub","ingredients":["2 cloves garlic, minced","6 tablespoons light olive oil","1 teaspoon dried basil","1 teaspoon salt","1 teaspoon ground black pepper","1 tablespoon lemon juice","1 tablespoon fresh parsley, chopped","2 (6 ounce) fillets salmon"],"steps":["In a medium glass bowl, prepare marinade by mixing garlic, light olive oil, basil, salt, pepper, lemon juice and parsley. Place salmon fillets in a medium glass baking dish, and cover with the marinade. Marinate in the refrigerator about 1 hour, turning occasionally.","Preheat oven to 375 degrees F (190 degrees C).","Place fillets in aluminum foil, cover with marinade, and seal. Place sealed salmon in the glass dish, and bake 35 to 45 minutes, until easily flaked with a fork."],"class":["pescatarian"]},{"title":"Grilled Tilapia with Mango Salsa","link":"https://www.allrecipes.com/recipe/166771/grilled-tilapia-with-mango-salsa/?internalSource=staff%20pick&referringId=13290&referringContentType=Recipe%20Hub","ingredients":["1/3 cup extra-virgin olive oil","1 tablespoon lemon juice","1 tablespoon minced fresh parsley","1 clove garlic, minced","1 teaspoon dried basil","1 teaspoon ground black pepper","1/2 teaspoon salt","2 (6 ounce) tilapia fillets","1 large ripe mango, peeled, pitted and diced","1/2 red bell pepper, diced","2 tablespoons minced red onion","1 tablespoon chopped fresh cilantro","1 jalapeno pepper, seeded and minced","2 tablespoons lime juice","1 tablespoon lemon juice","salt and pepper to taste"],"steps":["Whisk together the extra-virgin olive oil, 1 tablespoon lemon juice, parsley, garlic, basil, 1 teaspoon pepper, and 1/2 teaspoon salt in a bowl and pour into a resealable plastic bag. Add the tilapia fillets, coat with the marinade, squeeze out excess air, and seal the bag. Marinate in the refrigerator for 1 hour.","Prepare the mango salsa by combining the mango, red bell pepper, red onion, cilantro, and jalapeno pepper in a bowl. Add the lime juice and 1 tablespoon of lemon juice, and toss well. Season to taste with salt and pepper, and refrigerate until ready to serve.","Preheat an outdoor grill for medium-high heat, and lightly oil grate.","Remove the tilapia from the marinade, and shake off excess. Discard the remaining marinade. Grill the fillets until the fish is no longer translucent in the center, and flakes easily with a fork, 3 to 4 minutes per side, depending on the thickness of the fillets. Serve the tilapia topped with mango salsa."],"class":["pescatarian"]},{"title":"Baked Salmon Fillets Dijon","link":"https://www.allrecipes.com/recipe/22538/baked-salmon-fillets-dijon/?internalSource=staff%20pick&referringId=13290&referringContentType=Recipe%20Hub","ingredients":["4 (4 ounce) fillets salmon","3 tablespoons prepared Dijon-style mustard","salt and pepper to taste","1/4 cup Italian-style dry bread crumbs","1/4 cup butter, melted"],"steps":["Preheat oven to 400 degrees F (200 degrees C). Line a shallow baking pan with aluminum foil.","Place salmon skin-side down on foil. Spread a thin layer of mustard on the top of each fillet, and season with salt and pepper. Top with bread crumbs, then drizzle with melted butter.","Bake in a preheated oven for 15 minutes, or until salmon flakes easily with a fork."],"class":["pescatarian"]},{"title":"Quick and Easy Tuna Casserole","link":"https://www.allrecipes.com/recipe/16964/quick-and-easy-tuna-casserole/?internalSource=staff%20pick&referringId=13290&referringContentType=Recipe%20Hub","ingredients":["1 (12 ounce) package egg noodles","2 cups frozen green peas","2 (10.75 ounce) cans condensed cream of mushroom soup","2 (5 ounce) cans tuna, drained","1 onion, chopped","10 slices American processed cheese","ground black pepper to taste"],"steps":["Bring a large pot of water to a boil. Add noodles and frozen peas. Cook until noodles are al dente, drain well. Return noodles and peas to the pot.","Mix soup, tuna fish, onions, processed cheese and pepper into the pot. Stir constantly until all of the ingredients are well mixed and the cheese has melted. Serve."],"class":["pescatarian"]},{"title":"Margarita Grilled Shrimp","link":"https://www.allrecipes.com/recipe/60111/margarita-grilled-shrimp/?internalSource=staff%20pick&referringId=13290&referringContentType=Recipe%20Hub","ingredients":["1 pound shrimp, peeled and deveined","3 tablespoons olive oil","3 tablespoons chopped fresh cilantro","2 tablespoons fresh lime juice","2 cloves garlic, minced","2 teaspoons tequila","1/4 teaspoon cayenne pepper","1/4 teaspoon salt","4 bamboo skewers, soaked in water for 20 minutes"],"steps":["Stir shrimp, olive oil, cilantro, lime juice, garlic, tequila, cayenne pepper, and salt together in a bowl. Cover the bowl with plastic wrap and refrigerate shrimp in marinade for 30 minutes.","Preheat an outdoor grill for high heat and lightly oil grate.","Remove shrimp from bowl and thread onto skewers; discard marinade.","Cook on the preheated grill until shrimp turn pink, 2 to 3 minutes per side."],"class":["pescatarian"]},{"title":"Baked Halibut Steaks","link":"https://www.allrecipes.com/recipe/43719/baked-halibut-steaks/?internalSource=staff%20pick&referringId=13290&referringContentType=Recipe%20Hub","ingredients":["1 teaspoon olive oil","1 cup diced zucchini","1/2 cup minced onion","1 clove garlic, peeled and minced","2 cups diced fresh tomatoes","2 tablespoons chopped fresh basil","1/4 teaspoon salt","1/4 teaspoon ground black pepper","4 (6 ounce) halibut steaks","1/3 cup crumbled feta cheese"],"steps":["Preheat oven to 450 degrees F (230 degrees C). Lightly grease a shallow baking dish.","Heat olive oil in a medium saucepan over medium heat and stir in zucchini, onion, and garlic. Cook and stir 5 minutes or until tender. Remove saucepan from heat and mix in tomatoes, basil, salt, and pepper.","Arrange halibut steaks in a single layer in the prepared baking dish. Spoon equal amounts of the zucchini mixture over each steak. Top with feta cheese.","Bake 15 minutes in the preheated oven, or until fish is easily flaked with a fork."],"class":["pescatarian"]},{"title":"Crispy Fish Fillets","link":"https://www.allrecipes.com/recipe/24507/crispy-fish-fillets/?internalSource=staff%20pick&referringId=13290&referringContentType=Recipe%20Hub","ingredients":["1 egg","2 tablespoons prepared yellow mustard","1/2 teaspoon salt","1 1/2 cups instant mashed potato flakes","1/4 cup oil for frying","4 (6 ounce) fillets sole"],"steps":["In a shallow dish, whisk together the egg, mustard, and salt; set aside. Place the potato flakes in another shallow dish.","Heat oil in a large heavy skillet over medium-high heat.","Dip fish fillets in the egg mixture. Dredge the fillets in the potato flakes, making sure to completely coat the fish. For extra crispy, dip into egg and potato flakes again.","Fry fish fillets in oil for 3 to 4 minutes on each side, or until golden brown."],"class":["pescatarian"]},{"title":"Broiled Lobster Tails","link":"https://www.allrecipes.com/recipe/34638/broiled-lobster-tails/?internalSource=staff%20pick&referringId=13290&referringContentType=Recipe%20Hub","ingredients":["2 whole lobster tails","1/2 cup butter, melted","1/2 teaspoon ground paprika","salt to taste","ground white pepper, to taste","1 lemon - cut into wedges, for garnish"],"steps":["Preheat the broiler.","Place lobster tails on a baking sheet. With a sharp knife or kitchen shears, carefully cut top side of lobster shells lengthwise. Pull apart shells slightly, and season meat with equal amounts butter, paprika, salt, and white pepper.","Broil lobster tails until lightly browned and lobster meat is opaque, about 5 to 10 minutes. Garnish with lemon wedges to serve."],"class":["pescatarian"]},{"title":"Miso-Glazed Black Cod","link":"https://www.allrecipes.com/recipe/237637/miso-glazed-black-cod/?internalSource=staff%20pick&referringId=13290&referringContentType=Recipe%20Hub","ingredients":["3 tablespoons white miso paste","2 tablespoons water","2 tablespoons mirin (Japanese sweet wine)","2 tablespoons sake","1 tablespoon brown sugar","2 (7 ounce) black cod fillets"],"steps":["Set oven rack about 6 inches from the heat source and preheat the oven's broiler. Line a baking sheet with aluminum foil and lightly grease the aluminum foil.","Whisk miso paste, water, mirin, sake, and brown sugar together in a small skillet over medium heat until mixture simmers and thickens slightly, 1 to 3 minutes. Remove from heat and cool completely.","Place cod fillets on prepared baking sheet. Brush fillets all over with miso mixture. Rest fillets at room temperature to quickly marinate, 15 to 20.","Broil fillets in the preheated oven for 5 minutes. Turn the baking sheet 180 degrees and continue broiling until fish flakes easily with a fork, about 5 minutes more. Remove pin bones."],"class":["pescatarian"]},{"title":"Broiled Tilapia Parmesan","link":"https://www.allrecipes.com/recipe/50644/broiled-tilapia-parmesan/?internalSource=hub%20recipe&referringId=13290&referringContentType=Recipe%20Hub","ingredients":["1/2 cup Parmesan cheese","1/4 cup butter, softened","3 tablespoons mayonnaise","2 tablespoons fresh lemon juice","1/4 teaspoon dried basil","1/4 teaspoon ground black pepper","1/8 teaspoon onion powder","1/8 teaspoon celery salt","2 pounds tilapia fillets"],"steps":["Preheat your oven's broiler. Grease a broiling pan or line pan with aluminum foil.","In a small bowl, mix together the Parmesan cheese, butter, mayonnaise and lemon juice. Season with dried basil, pepper, onion powder and celery salt. Mix well and set aside.","Arrange fillets in a single layer on the prepared pan. Broil a few inches from the heat for 2 to 3 minutes. Flip the fillets over and broil for a couple more minutes. Remove the fillets from the oven and cover them with the Parmesan cheese mixture on the top side. Broil for 2 more minutes or until the topping is browned and fish flakes easily with a fork. Be careful not to over cook the fish."],"class":["pescatarian"]},{"title":"Maple Salmon","link":"https://www.allrecipes.com/recipe/51283/maple-salmon/?internalSource=hub%20recipe&referringId=13290&referringContentType=Recipe%20Hub","ingredients":["1/4 cup maple syrup","2 tablespoons soy sauce","1 clove garlic, minced","1/4 teaspoon garlic salt","1/8 teaspoon ground black pepper","1 pound salmon"],"steps":["In a small bowl, mix the maple syrup, soy sauce, garlic, garlic salt, and pepper.","Place salmon in a shallow glass baking dish, and coat with the maple syrup mixture. Cover the dish, and marinate salmon in the refrigerator 30 minutes, turning once.","Preheat oven to 400 degrees F (200 degrees C).","Place the baking dish in the preheated oven, and bake salmon uncovered 20 minutes, or until easily flaked with a fork."],"class":["pescatarian"]},{"title":"Grilled Salmon I","link":"https://www.allrecipes.com/recipe/12720/grilled-salmon-i/?internalSource=hub%20recipe&referringId=13290&referringContentType=Recipe%20Hub","ingredients":["1 1/2 pounds salmon fillets","lemon pepper to taste","garlic powder to taste","salt to taste","1/3 cup soy sauce","1/3 cup brown sugar","1/3 cup water","1/4 cup vegetable oil"],"steps":["Season salmon fillets with lemon pepper, garlic powder, and salt.","In a small bowl, stir together soy sauce, brown sugar, water, and vegetable oil until sugar is dissolved. Place fish in a large resealable plastic bag with the soy sauce mixture, seal, and turn to coat. Refrigerate for at least 2 hours.","Preheat grill for medium heat.","Lightly oil grill grate. Place salmon on the preheated grill, and discard marinade. Cook salmon for 6 to 8 minutes per side, or until the fish flakes easily with a fork."],"class":["pescatarian"]},{"title":"Marinated Grilled Shrimp","link":"https://www.allrecipes.com/recipe/21694/marinated-grilled-shrimp/?internalSource=hub%20recipe&referringId=13290&referringContentType=Recipe%20Hub","ingredients":["3 cloves garlic, minced","1/3 cup olive oil","1/4 cup tomato sauce","2 tablespoons red wine vinegar","2 tablespoons chopped fresh basil","1/2 teaspoon salt","1/4 teaspoon cayenne pepper","2 pounds fresh shrimp, peeled and deveined","skewers"],"steps":["In a large bowl, stir together the garlic, olive oil, tomato sauce, and red wine vinegar. Season with basil, salt, and cayenne pepper. Add shrimp to the bowl, and stir until evenly coated. Cover, and refrigerate for 30 minutes to 1 hour, stirring once or twice.","Preheat grill for medium heat. Thread shrimp onto skewers, piercing once near the tail and once near the head. Discard marinade.","Lightly oil grill grate. Cook shrimp on preheated grill for 2 to 3 minutes per side, or until opaque."],"class":["pescatarian"]},{"title":"Baked Dijon Salmon","link":"https://www.allrecipes.com/recipe/21176/baked-dijon-salmon/?internalSource=hub%20recipe&referringId=13290&referringContentType=Recipe%20Hub","ingredients":["1/4 cup butter, melted","3 tablespoons Dijon mustard","1 1/2 tablespoons honey","1/4 cup dry bread crumbs","1/4 cup finely chopped pecans","4 teaspoons chopped fresh parsley","4 (4 ounce) fillets salmon","salt and pepper to taste","1 lemon, for garnish"],"steps":["Preheat oven to 400 degrees F (200 degrees C).","In a small bowl, stir together butter, mustard, and honey. Set aside. In another bowl, mix together bread crumbs, pecans, and parsley.","Brush each salmon fillet lightly with honey mustard mixture, and sprinkle the tops of the fillets with the bread crumb mixture.","Bake salmon 12 to 15 minutes in the preheated oven, or until it flakes easily with a fork. Season with salt and pepper, and garnish with a wedge of lemon."],"class":["pescatarian"]},{"title":"Szechwan Shrimp","link":"https://www.allrecipes.com/recipe/86230/szechwan-shrimp/?internalSource=hub%20recipe&referringId=13290&referringContentType=Recipe%20Hub","ingredients":["4 tablespoons water","2 tablespoons ketchup","1 tablespoon soy sauce","2 teaspoons cornstarch","1 teaspoon honey","1/2 teaspoon crushed red pepper","1/4 teaspoon ground ginger","1 tablespoon vegetable oil","1/4 cup sliced green onions","4 cloves garlic, minced","12 ounces cooked shrimp, tails removed"],"steps":["In a bowl, stir together water, ketchup, soy sauce, cornstarch, honey, crushed red pepper, and ground ginger. Set aside.","Heat oil in a large skillet over medium-high heat. Stir in green onions and garlic; cook 30 seconds. Stir in shrimp, and toss to coat with oil. Stir in sauce. Cook and stir until sauce is bubbly and thickened."],"class":["pescatarian"]},{"title":"Ginger Glazed Mahi Mahi","link":"https://www.allrecipes.com/recipe/45833/ginger-glazed-mahi-mahi/?internalSource=hub%20recipe&referringId=13290&referringContentType=Recipe%20Hub","ingredients":["3 tablespoons honey","3 tablespoons soy sauce","3 tablespoons balsamic vinegar","1 teaspoon grated fresh ginger root","1 clove garlic, crushed or to taste","2 teaspoons olive oil","4 (6 ounce) mahi mahi fillets","salt and pepper to taste","1 tablespoon vegetable oil"],"steps":["In a shallow glass dish, stir together the honey, soy sauce, balsamic vinegar, ginger, garlic and olive oil. Season fish fillets with salt and pepper, and place them into the dish. If the fillets have skin on them, place them skin side down. Cover, and refrigerate for 20 minutes to marinate.","Heat vegetable oil in a large skillet over medium-high heat. Remove fish from the dish, and reserve marinade. Fry fish for 4 to 6 minutes on each side, turning only once, until fish flakes easily with a fork. Remove fillets to a serving platter and keep warm.","Pour reserved marinade into the skillet, and heat over medium heat until the mixture reduces to a glaze consistently. Spoon glaze over fish, and serve immediately."],"class":["pescatarian"]},{"title":"Fish Tacos","link":"https://www.allrecipes.com/recipe/53729/fish-tacos/?internalSource=hub%20recipe&referringId=13290&referringContentType=Recipe%20Hub","ingredients":["1 cup all-purpose flour","2 tablespoons cornstarch","1 teaspoon baking powder","1/2 teaspoon salt","1 egg","1 cup beer","1/2 cup plain yogurt","1/2 cup mayonnaise","1 lime, juiced","1 jalapeno pepper, minced","1 teaspoon minced capers","1/2 teaspoon dried oregano","1/2 teaspoon ground cumin","1/2 teaspoon dried dill weed","1 teaspoon ground cayenne pepper","1 quart oil for frying","1 pound cod fillets, cut into 2 to 3 ounce portions","1 (12 ounce) package corn tortillas","1/2 medium head cabbage, finely shredded"],"steps":["To make beer batter: In a large bowl, combine flour, cornstarch, baking powder, and salt. Blend egg and beer, then quickly stir into the flour mixture (don't worry about a few lumps).","To make white sauce: In a medium bowl, mix together yogurt and mayonnaise. Gradually stir in fresh lime juice until consistency is slightly runny. Season with jalapeno, capers, oregano, cumin, dill, and cayenne.","Heat oil in deep-fryer to 375 degrees F (190 degrees C).","Dust fish pieces lightly with flour. Dip into beer batter, and fry until crisp and golden brown. Drain on paper towels. Lightly fry tortillas; not too crisp. To serve, place fried fish in a tortilla, and top with shredded cabbage, and white sauce."],"class":["pescatarian"]},{"title":"Shrimp Scampi Bake","link":"https://www.allrecipes.com/recipe/25874/shrimp-scampi-bake/?internalSource=hub%20recipe&referringId=13290&referringContentType=Recipe%20Hub","ingredients":["1 cup butter","2 tablespoons prepared Dijon-style mustard","1 tablespoon fresh lemon juice","1 tablespoon chopped garlic","1 tablespoon chopped fresh parsley","2 pounds medium raw shrimp, shelled, deveined, with tails attached"],"steps":["Preheat oven to 450 degrees F (230 degrees C).","In a small saucepan over medium heat, combine the butter, mustard, lemon juice, garlic, and parsley. When the butter melts completely, remove from heat.","Arrange shrimp in a shallow baking dish. Pour the butter mixture over the shrimp.","Bake in preheated oven for 12 to 15 minutes or until the shrimp are pink and opaque."],"class":["pescatarian"]},{"title":"Lemon Garlic Tilapia","link":"https://www.allrecipes.com/recipe/89261/lemon-garlic-tilapia/?internalSource=hub%20recipe&referringId=13290&referringContentType=Recipe%20Hub","ingredients":["4 tilapia fillets","3 tablespoons fresh lemon juice","1 tablespoon butter, melted","1 clove garlic, finely chopped","1 teaspoon dried parsley flakes","pepper to taste"],"steps":["Preheat oven to 375 degrees F (190 degrees C). Spray a baking dish with non-stick cooking spray.","Rinse tilapia fillets under cool water, and pat dry with paper towels.","Place fillets in baking dish. Pour lemon juice over fillets, then drizzle butter on top. Sprinkle with garlic, parsley, and pepper.","Bake in preheated oven until the fish is white and flakes when pulled apart with a fork, about 30 minutes."],"class":["pescatarian"]},{"title":"Peppered Shrimp Alfredo","link":"https://www.allrecipes.com/recipe/133128/peppered-shrimp-alfredo/?internalSource=hub%20recipe&referringId=13290&referringContentType=Recipe%20Hub","ingredients":["12 ounces penne pasta","1/4 cup butter","2 tablespoons extra-virgin olive oil","1 onion, diced","2 cloves garlic, minced","1 red bell pepper, diced","1/2 pound portobello mushrooms, diced","1 pound medium shrimp, peeled and deveined","1 (15 ounce) jar Alfredo sauce","1/2 cup grated Romano cheese","1/2 cup cream","1 teaspoon cayenne pepper, or more to taste","Salt and pepper to taste","1/4 cup chopped parsley"],"steps":["Bring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain.","Meanwhile, melt butter together with the olive oil in a saucepan over medium heat. Stir in onion, and cook until softened and translucent, about 2 minutes. Stir in garlic, red pepper, and mushroom; cook over medium-high heat until soft, about 2 minutes more.","Stir in the shrimp, and cook until firm and pink, then pour in Alfredo sauce, Romano cheese, and cream; bring to a simmer stirring constantly until thickened, about 5 minutes. Season with cayenne, salt, and pepper to taste. Stir drained pasta into the sauce, and serve sprinkled with chopped parsley."],"class":["pescatarian"]},{"title":"Coconut Shrimp I","link":"https://www.allrecipes.com/recipe/17753/coconut-shrimp-i/?internalSource=hub%20recipe&referringId=13290&referringContentType=Recipe%20Hub","ingredients":["1 egg","1/2 cup all-purpose flour","2/3 cup beer","1 1/2 teaspoons baking powder","1/4 cup all-purpose flour","2 cups flaked coconut","24 shrimp","3 cups oil for frying"],"steps":["In medium bowl, combine egg, 1/2 cup flour, beer and baking powder. Place 1/4 cup flour and coconut in two separate bowls.","Hold shrimp by tail, and dredge in flour, shaking off excess flour. Dip in egg/beer batter; allow excess to drip off. Roll shrimp in coconut, and place on a baking sheet lined with wax paper. Refrigerate for 30 minutes. Meanwhile, heat oil to 350 degrees F (175 degrees C) in a deep-fryer.","Fry shrimp in batches: cook, turning once, for 2 to 3 minutes, or until golden brown. Using tongs, remove shrimp to paper towels to drain. Serve warm with your favorite dipping sauce."],"class":["pescatarian"]},{"title":"Shrimp Lemon Pepper Linguini","link":"https://www.allrecipes.com/recipe/40154/shrimp-lemon-pepper-linguini/?internalSource=hub%20recipe&referringId=13290&referringContentType=Recipe%20Hub","ingredients":["1 (8 ounce) package linguine pasta","1 tablespoon olive oil","6 cloves garlic, minced","1/2 cup chicken broth","1/4 cup white wine","1 lemon, juiced","1/2 teaspoon lemon zest","salt to taste","2 teaspoons freshly ground black pepper","1 pound fresh shrimp, peeled and deveined","1/4 cup butter","3 tablespoons chopped fresh parsley","1 tablespoon chopped fresh basil"],"steps":["Bring a large pot of lightly salted water to a boil. Add linguine, and cook for 9 to 13 minutes or until al dente; drain.","Heat oil in a large saucepan over medium heat, and saute garlic about 1 minute. Mix in chicken broth, wine, lemon juice, lemon zest, salt, and pepper. Reduce heat, and simmer until liquid is reduced by about 1/2.","Mix shrimp, butter, parsley, and basil into the saucepan. Cook 2 to 3 minutes, until shrimp is opaque. Stir in the cooked linguine, and continue cooking 2 minutes, until well coated."],"class":["pescatarian"]},{"title":"Alaska Salmon Bake with Pecan Crunch Coating","link":"https://www.allrecipes.com/recipe/9336/alaska-salmon-bake-with-pecan-crunch-coating/?internalSource=hub%20recipe&referringId=13290&referringContentType=Recipe%20Hub","ingredients":["3 tablespoons Dijon mustard","3 tablespoons butter, melted","5 teaspoons honey","1/2 cup fresh bread crumbs","1/2 cup finely chopped pecans","3 teaspoons chopped fresh parsley","6 (4 ounce) fillets salmon","salt and pepper to taste","6 lemon wedges"],"steps":["Preheat the oven to 400 degrees F (200 degrees C). In a small bowl, mix together the mustard, butter, and honey. In another bowl, mix together the bread crumbs, pecans, and parsley.","Season each salmon fillet with salt and pepper. Place on a lightly greased baking sheet. Brush with mustard-honey mixture. Cover the top of each fillet with bread crumb mixture.","Bake for 10 minutes per inch of thickness, measured at thickest part, or until salmon just flakes when tested with a fork. Serve garnished with lemon wedges."],"class":["pescatarian"]},{"title":"Grilled Marinated Shrimp","link":"https://www.allrecipes.com/recipe/19484/grilled-marinated-shrimp/?internalSource=hub%20recipe&referringId=13290&referringContentType=Recipe%20Hub","ingredients":["1 cup olive oil","1/4 cup chopped fresh parsley","1 lemon, juiced","2 tablespoons hot pepper sauce","3 cloves garlic, minced","1 tablespoon tomato paste","2 teaspoons dried oregano","1 teaspoon salt","1 teaspoon ground black pepper","2 pounds large shrimp, peeled and deveined with tails attached","skewers"],"steps":["In a mixing bowl, mix together olive oil, parsley, lemon juice, hot sauce, garlic, tomato paste, oregano, salt, and black pepper. Reserve a small amount for basting later. Pour remaining marinade into a large resealable plastic bag with shrimp. Seal, and marinate in the refrigerator for 2 hours.","Preheat grill for medium-low heat. Thread shrimp onto skewers, piercing once near the tail and once near the head. Discard marinade.","Lightly oil grill grate. Cook shrimp for 5 minutes per side, or until opaque, basting frequently with reserved marinade."],"class":["pescatarian"]},{"title":"Balsamic-Glazed Salmon Fillets","link":"https://www.allrecipes.com/recipe/82817/balsamic-glazed-salmon-fillets/?internalSource=hub%20recipe&referringId=13290&referringContentType=Recipe%20Hub","ingredients":["6 (5 ounce) salmon fillets","4 cloves garlic, minced","1 tablespoon white wine","1 tablespoon honey","1/3 cup balsamic vinegar","4 teaspoons Dijon mustard","salt and pepper to taste","1 tablespoon chopped fresh oregano"],"steps":["Preheat oven to 400 degrees F (200 degrees C). Line a baking sheet with aluminum foil, and spray with non-stick cooking spray.","Coat a small saucepan with non-stick cooking spray. Over medium heat, cook and stir garlic until soft, about 3 minutes. Mix in white wine, honey, balsamic vinegar, mustard, and salt and pepper. Simmer, uncovered, for about 3 minutes, or until slightly thickened.","Arrange salmon fillets on foil-lined baking sheet. Brush fillets with balsamic glaze, and sprinkle with oregano.","Bake in preheated oven for 10 to 14 minutes, or until flesh flakes easily with a fork. Brush fillets with remaining glaze, and season with salt and pepper. Use a spatula to transfer fillets to serving platter, leaving the skin behind on the foil."],"class":["pescatarian"]},{"title":"Creamy Pesto Shrimp","link":"https://www.allrecipes.com/recipe/11808/creamy-pesto-shrimp/?internalSource=hub%20recipe&referringId=13290&referringContentType=Recipe%20Hub","ingredients":["1 pound linguine pasta","1/2 cup butter","2 cups heavy cream","1/2 teaspoon ground black pepper","1 cup grated Parmesan cheese","1/3 cup pesto","1 pound large shrimp, peeled and deveined"],"steps":["Bring a large pot of lightly salted water to a boil. Add linguine pasta, and cook for 8 to 10 minutes, or until al dente; drain. Watch Now","In a large skillet, melt the butter over medium heat. Stir in cream, and season with pepper. Cook 6 to 8 minutes, stirring constantly. Watch Now","Stir Parmesan cheese into cream sauce, stirring until thoroughly mixed. Blend in the pesto, and cook for 3 to 5 minutes, until thickened. Watch Now","Stir in the shrimp, and cook until they turn pink, about 5 minutes. Serve over the hot linguine. Watch Now"],"class":["pescatarian"]},{"title":"Firecracker Grilled Alaska Salmon","link":"https://www.allrecipes.com/recipe/16699/firecracker-grilled-alaska-salmon/?internalSource=hub%20recipe&referringId=13290&referringContentType=Recipe%20Hub","ingredients":["8 (4 ounce) fillets salmon","1/2 cup peanut oil","4 tablespoons soy sauce","4 tablespoons balsamic vinegar","4 tablespoons green onions, chopped","3 teaspoons brown sugar","2 cloves garlic, minced","1 1/2 teaspoons ground ginger","2 teaspoons crushed red pepper flakes","1 teaspoon sesame oil","1/2 teaspoon salt"],"steps":["Place salmon filets in a medium, nonporous glass dish. In a separate medium bowl, combine the peanut oil, soy sauce, vinegar, green onions, brown sugar, garlic, ginger, red pepper flakes, sesame oil and salt. Whisk together well, and pour over the fish. Cover and marinate the fish in the refrigerator for 4 to 6 hours.","Prepare an outdoor grill with coals about 5 inches from the grate, and lightly oil the grate.","Grill the fillets 5 inches from coals for 10 minutes per inch of thickness, measured at the thickest part, or until fish just flakes with a fork. Turn over halfway through cooking."],"class":["pescatarian"]}]}